'''
ข้อมูลนำเข้า

บรรทัดเดียว จำนวนเต็มบวก d Vr Vt และ Vf ตามลำดับห่างกันด้วยเว้นวรรคหนึ่งช่อง โดยตัวเลขทุกตัวเลขทุกตัวจะไม่เกิน 5000 และ Vt > Vr และแมลงวันบินด้วยความเร็วสูงกว่าเต่าและกระต่ายเสมอ

ข้อมูลส่งออก

บรรทัดเดียว ระยะทางของแมลงวันที่บินได้ทั้งหมด โดยให้ตอบเป็นทศนิยม 2 ตำแหน่ง

*** ห้ามใช้ For / While Loop ***



Hint : S = VT

*** Rabbit & Turtle ***
Enter Input : 10 1 2 300
3000.00



*** Rabbit & Turtle ***
Enter Input : 20 2 4 200
2000.00


'''


print("*** Rabbit & Turtle ***")
d ,Vr ,Vt , Vf = map(int,input("Enter Input : ").split())

s = Vf*(d/(Vt - Vr))
print("%.2f" %s)
